# -*- coding: utf-8 -*-
"""
Created on Thu Jun  3 13:07:33 2021

@author: isara
"""
import numpy as np 
import pandas as pd
import ast
import joblib
import dill as pickle
from sklearn.naive_bayes import MultinomialNB
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.metrics import f1_score, accuracy_score
from sklearn.model_selection import train_test_split
from pythainlp import word_tokenize

# Read File
file = pd.read_csv('df_all_genre.csv',encoding='utf-8')
file.drop(columns='Unnamed: 0', inplace=True)
file.head()

# Retrieve List from String
file['Chapter'] = file['Chapter'].apply(lambda x: ast.literal_eval(x))

def dummy_fun(doc):
    return doc

# Create Tfidf Vect
tfidf = TfidfVectorizer(
    analyzer='word',
    tokenizer=dummy_fun,
    preprocessor=dummy_fun,
    token_pattern=None,
    max_features=5000,
    min_df=0.01
)

# Transform to Tfidf Vect
X = tfidf.fit_transform(file['Chapter'])
# Set y
y = file['Genre']

# Split data
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3, random_state=0)

# Create Naive Bayes Model
nb = MultinomialNB()
nb.fit(X_train, y_train)

# Evaluate Performance
y_pred = nb.predict(X_test)
f1_sc = np.round(f1_score(y_test, y_pred, average='macro'),3)
ac_sc = np.round(accuracy_score(y_test, y_pred),2)
print('F1 score = ',f1_sc)
print('Accuracy = ',ac_sc)

# Test Predict Example with string
ex = """
ที่ชั้นบนของสถานีตำรวจ ไอ้ศักดิ์หรือนายบุญศักดิ์ หนามทอง มือปืนที่แทนไทจับตัวได้เมื่อวานกำลังนั่งอยู่ในห้องขัง แม้จะเป็นเวลาที่ล่วงเลยการหลับพักมานานพอสมควรแล้ว แต่มันยังคงตื่นอยู่ ไม่ใช่เพราะหวาดกลัว ไม่ใช่เพราะกังวลหรือสำนึกผิดต่อบาปที่ได้กระทำ และยิ่งไม่ใช่เพราะเสียงกรนของใครบางคนที่อยู่ในห้องขังใกล้ๆ กัน หากแต่เป็นเพราะมันกำลังเตรียมใจเพื่อบางสิ่ง บางสิ่งที่มีแต่มันเท่านั้นที่เข้าใจ พลันมันล้วงเศษกระดาษจากด้านในของกางเกงออกมาเปิดอ่านอีกครั้ง เพราะความโชคร้ายบางอย่างจึงทำให้มันถูกจับ แต่เมื่อมีเศษกระดาษแผ่นนี้ มันรู้ได้ในทันที ว่าอีกไม่นานอิสระจะเรียกหามันอีกครั้ง...

**********************************************



อีกด้านหนึ่งไตรซึ่งหนีออกมาจากโรงพยาบาล กำลังเดินทางกลับมาที่สถานีตำรวจโดยไม่รู้ว่าทุกคนในทีมสืบคดีไปที่ตึกร้าง รถแท็กซี่จอดลงตรงด้านหน้าสถานีตำรวจ ไตรสติเลือนลางในตอนที่คนขับรถเรียก เขาจ่ายเงินก่อนจะลงจากรถอย่างทุลักทุเล



ขณะนั้นจ่าสุรพลกำลังนั่งดูโทรทัศน์อย่างสบายอารมณ์อยู่ที่โต๊ะร้องทุกข์ด้านหน้าสถานี พลันสีหน้าเขาเปลี่ยนไป เมื่อเห็นไตรที่กำลังเดินเข้ามาอย่างฝืนทน จ่าสุรพลรีบวิ่งเข้าไปพยุงเขา



“หมวดเป็นอะไรครับเนี่ย สภาพดูไม่ได้เลย”



“มะ...ไม่เป็นไร คนอื่นๆ ล่ะประชุมอยู่หรือ?”



“ประชุมอะไรกันครับ มีคนแจ้งความว่าพบศพคนโดนฆาตกรรม ทุกคนเขาไปที่เกิดเหตุกันหมดแล้วครับ”



“เหรอ ขอบใจมาก แล้วพวกเขาไปที่ไหนกัน?” ไตรเอ่ยเสียงแห้ง



“หมวดจะไปเหรอครับ ผมว่าอย่าเลย ท่าทางแย่ขนาดนี้ กลับไปพักดีกว่า เลยเวลาออกเวรตั้งนานแล้วด้วย”



“ไม่ได้ จะกินแรงคนอื่นได้ไงกัน” จ่าสุรพลประคองไตรลงนั่งที่เก้าอี้ในสถานีตำรวจ



“ที่นั้นมีคนอยู่กันเยอะแล้ว เชื่อผมเถอะ หมวดไม่ต้องไปหรอก”



นาทีนั้นมีรถตำรวจแล่นเข้ามาตรงด้านหน้าสถานีตำรวจ ความเร็วของรถบ่งบอกถึงความรีบร้อนของคนขับ ทันทีที่ล้อนิ่งสนิทแทนไทรีบก้าวลงมา เขาวิ่งเข้าไปในสถานีอย่างร้อนใจ

“ผู้กองครับ ผู้กอง โธ่เอ้ย! จะรีบร้อนไปไหนกันนะ” หมวดเจี๊ยบบ่นงำกับหมวดนเรศและนายตำรวจอีกสองสามคนที่นั่งมาด้วยกัน



“นั่นสิ ที่โน้นยังคลียร์พื้นที่ไม่เสร็จเลย ทำไมผู้กองถึงรีบกลับมา” หมวดนเรศเอ่ยอย่างสงสัย



“จ่า ไอ้ศักดิ์ล่ะ?” ทันทีที่เห็นจ่าสุรพล แทนไทถามขึ้นอย่างกังวล



“ยะ...อยู่ในห้องขังไงครับ” สิ้นคำตอบแทนไทรีบขึ้นบันไดไปด้านบนซึ่งเป็นพื้นที่ในส่วนห้องขัง คนอื่นๆ รีบวิ่งตามเข้ามา



“เกิดอะไรขึ้นเหรอครับ หมวด?” จ่าสุรพลถามหน้าตื่น เมื่อพวกหมวดเจี๊ยบเข้ามาในสถานี



“ไม่รู้เหมือนกัน เห็นเขารีบกลับมา บอกว่าคนร้ายอยู่ที่สถานี อ้าว! แล้วนี่ไอ้ไตรเป็นอะไรน่ะ เฮ้ย! หัวมันมีเลือดออกด้วยนี่” หมวดเจี๊ยบถามขึ้นเมื่อเห็นไตรนั่งหมดสภาพอยู่บนเก้าอี้



“ไม่เป็นอะไร แกอย่าเสียงดังสิวะ มันสะเทือนหัว” ไตรเอ่ยเสียงแห้ง



“เฮ้ย! แผลขนาดนี้ไปโรงพยาบาลดีกว่ามั้ง จะว่าไปข้าจำได้ว่าเมื่อกี้จ่าสม เขาบอกว่าเอ็งอยู่โรงพยาบาลนี่หว่า อย่าบอกนะว่าหนีกลับมา” หมวดนเรศพูดขึ้น



“ที่นั่นเขาให้คนป่วยนอน ฉันไม่ได้เป็นอะไร จะไปอยู่ทำไมนานๆ”



“แน่นะเว้ยว่าไม่ได้หนีออกมา”



“เออ... ว่าแต่เรื่องคดีเป็นยังไง?” ไตรรีบเปลี่ยนเรื่องเพราะกลัวถูกจับได้ว่าหนีมาจริงๆ



“คดีไหนล่ะ ถ้าเรื่องคดีของเด็กวัยรุ่นเมื่อเช้า ผู้กองเขาบอกว่าจับคนร้ายได้แล้ว ส่วนคดีที่พวกฉันเพิ่งไปเจอมาเมื่อกี้ ผู้กองบอกว่าคนร้ายอยู่ที่นี่” หมวดเจี๊ยบตอบคำถามเพื่อน



“หมายความว่ายังไง?” ไตรถามอย่างสงสัย



“ฉันก็ไม่เข้าใจเหมือนกัน คงต้องรอผู้กองบอก”



“ใครก็ได้ขึ้นมาบนนี้ที” เสียงแทนไทตะโกนลงมาจากชั้นบน พวกหมวดเจี๊ยบรีบวิ่งตามขึ้นไปทันที



ไตรพยายามฝืนลุกขึ้นตามไป แต่กลับหมดแรงล้มลงจนจ่าสุรพลต้องรีบประคอง เมื่อขึ้นนั่งบนเก้าอี้ตัวเดิม สายตาของไตรพลันเห็นใครคนหนึ่งยืนอยู่เบื้องหน้าของสถานี ต้นข้าวยืนน้ำตาคลอมองมาที่เขา



“มาที่นี่ได้ยังไง?” ไตรเอ่ยเสียงเบาคล้ายพูดกับตนเอง ในใจนึกหวั่น เพราะรู้ตัวว่าหลอกเธอให้รออยู่ที่โรงพยาบาล



ต้นข้าวไม่ตอบ เธอเดินเข้ามาหาเขา จ่าสุรพลเห็นท่าทางแล้วพอจะเดาออกเลยขอตัวไปดูพวกข้างบน เมื่อเหลือกันอยู่เพียงสองคน ไตรเอ่ยปากคิดจะขอโทษ แต่ยังไม่ทันที่จะได้พูดอะไร ฝ่ามือที่เคยประคองตนกลับตวัดเข้าที่ใบหน้าของเขาอย่างเต็มแรง



“นายทำอย่างนี้ได้ยังไง ฉันอุตส่าห์ห่วง อุตส่าห์หวังดี แล้วนายตอบแทนฉันอย่างนี้เหรอ”



“ผม เอ่อ...”



ต้นข้าวไม่ฟังคำแก้ตัว เธอหันหลังเดินกลับออกมาทันที ไตรคว้าแขนเธอเพื่ออธิบาย แต่เธอสะบัดมือเขาจนตัวเธอเสียหลักล้มลงตรงบันไดทางเข้าสถานี ไตรรีบก้มลงไปดูเธอ หากแต่อาการบาดเจ็บของตัวเอง ทำให้เคลื่อนไหวช้ากว่าที่เคย



“เป็นอะไรหรือเปล่า?”



“ไม่ต้องมายุ่ง นายจะไปที่ไหนก็เรื่องของนาย”



“ผมขอโทษ” ไตรเอ่ยคำที่ต้นข้าวไม่คิดว่าจะได้ยิน เธอนิ่งอึ้งอยู่เพียงพักหนึ่ง ก่อนจะลุกขึ้นแล้วเดินจากไตรไป โดยที่ไม่ฟังเสียงเรียกของเขาแม้แต่น้อย



ไตรยืนถอนหายใจอย่างจนปัญญา เพราะไม่คิดว่าหญิงสาวจะเสียใจขนาดนี้...



ที่ชั้นบนของสถานี แทนไทสั่งนายตำรวจที่อยู่เวรให้นำตัวศักดิ์ออกจากห้องขังไปไว้ที่ห้องสอบสวน นายตำรวจชั้นผู้น้อยทำตาม



“หมายความว่าไงครับ ผู้กองจะสอบปากคำไอ้ศักดิ์กลางดึกขนาดนี้ทำไม ที่สำคัญคดีที่มันฆ่านักการเมืองไปก่อนหน้านี้ เราก็มีหลักฐานมากพอจนไม่ต้องสอบสวนมันแล้วนี่ครับ” หมวดนเรศถามอย่างไม่เข้าใจ



“เพราะนี้เป็นคดีอื่นไง คดีของเด็กวัยรุ่นที่ชื่อโจ้ ทางเราได้อาวุธที่ใช้สังหารเหยื่อในที่เกิดเหตุ หลังการตรวจสอบอาวุธ เราพบลายนิ้วมือของไอ้ศักดิ์อยู่บนนั้น”



“หมายความว่าไอ้ศักดิ์ คือคนร้ายที่ผู้กองบอกว่าจับตัวได้แล้ว”



“ใช่ หากคำนวณจากเหตุการณ์ทั้งหมด ไอ้ศักดิ์กับนายโจ้อาจจะมีเรื่องขัดแย้งอะไรกัน นายโจ้จึงถูกไอ้ศักดิ์ฆ่าตาย พอกลับมาที่ห้องเช่าซึ่งอยู่ไม่ไกลจากที่เกิดเหตุ ก็โดนจับโดยบังเอิญในคดีเก่าที่มันเคยก่อไว้”



“อ้อ! อย่างนี้นี่เอง ว่าแต่ถ้ามีหลักฐานแล้วทำไมยังต้องสอบมันกลางดึกอย่างนี้ด้วยครับ”



“คดีที่เพิ่งเกิดขึ้นเมื่อกี้”



“อะไรนะครับ?” หมวดนเรศไม่เชื่อหูตัวเอง



“ศพที่เราเพิ่งไปเจอมาที่ตึกร้างเมื่อกี้ บนกำแพงนั่นพวกคุณคงได้เห็นแล้ว”



“ผู้กองหมายถึงตัวอักษรที่เขียนไว้ว่า ‘ทัณฑ์1’ เหรอครับ” หมวดเจี๊ยบพูดขึ้น



“ที่หน้าอกของศพนายโจ้ มีอักษรที่ถูกเขียนไว้ว่า ‘ทัณฑ์3’”



“ผู้กองหมายความว่า...” หมวดทั้งสองเอ่ยขึ้นพร้อมกันอย่างตระหนก



“ยังมีเหยื่ออีกคนที่เป็น ‘ทัณฑ์2’ ซึ่งตอนนี้เราไม่รู้ว่าคนๆ นั้นเป็นตายร้ายดียังไง มีเพียงคนเดียวเท่านั้นที่จะตอบเรื่องนี้ได้” แทนไทบอกเสียงเครียด



“คือไอ้ศักดิ์ที่เป็นฆาตกรใช่ไหมครับ” เสียงไตรดังขึ้น เขาเดินขึ้นมาทันฟังข้อสรุปทั้งหมดของแทนไท



“แต่มันจะเป็นไปได้ยังไงกัน ในเมื่อศพที่ตึกร้างนั้น พวกฝ่ายชันสูตรตรวจเบื้องต้นแล้วว่าเพิ่งตายมาไม่เกินสิบห้าชั่วโมง นั่นมันหลังจากที่ไอ้ศักดิ์ถูกจับแล้วนะครับ” หมวดนเรศถามขึ้น



“ศพที่ตึกร้างนั้น เขาอาจจะตายในวันนี้ แต่เขาไม่ได้ถูกกักขังในวันนี้ สุนัขตัวนั้นที่ถูกขังรวมกับผู้ตาย พวกคุณคิดว่ามันอดอาหารมาแล้วกี่วันถึงได้สามารถกินเนื้อคนได้ อีกอย่างประตูกรงที่ถูกเชื่อมปิดตายนั้น ผมให้พวกพิสูจน์หลักฐานตรวจแล้ว เขายืนยันว่ามันถูกเชื่อมไว้ไม่ต่ำกว่าสองวันแล้ว”



“นี่มันเรื่องบ้าอะไรกัน” หมวดเจี๊ยบสบถอย่างไม่เชื่อว่าเรื่องแบบนี้จะเกิดขึ้นจริง



“เพราะฉะนั้นยิ่งสอบปากคำมันเร็วเท่าไร เหยื่ออีกคนอาจจะมีโอกาสรอดชีวิตมากขึ้นเท่านั้น หมวดนเรศเดี๋ยวคุณเข้าไปสอบปากคำมันกับผม คนอื่นๆ ติดต่อกับจ่าสมควรที่อยู่ที่ตึกร้าง ถามเขาว่ามีรายละเอียดอะไรเพิ่มเติมไหม หากมีอะไรสำคัญให้รีบเข้าไปแจ้งให้ผมทราบทันที” นายตำรวจทุกนายรับคำอย่างแข็งขัน เพราะรู้ดีว่ามันเกี่ยวกับชีวิตๆ หนึ่งที่ยังไม่รู้ชะตากรรม

ภายในห้องสอบสวน ไอ้ศักดิ์นั่งอยู่บนเก้าอี้ ซึ่งอยู่ตรงข้ามกับแทนไทและหมวดนเรศโดย มีโต๊ะตัวหนึ่งกั้นกลางไว้ มันไม่ได้แสดงสีหน้าหรือท่าทางใดๆ ทั้งที่ถูกเรียกให้มาสอบปากคำในยามวิกาล นาฬิกาบนผนังด้านนอกบอกเวลาสี่ทุ่มเศษ ความเงียบปกคลุมทั่วห้อง ในที่สุดหมวดนเรศก็ทำลายความสงัดนั้นลง



“ต้องการอะไร? ทำไปเพื่ออะไร?”



“ผมต่างหากที่ต้องถามคุณตำรวจ ว่าต้องการอะไร? เรียกผมมาสอบกลางดึกอย่างนี้ พรุ่งนี้ผมต้องไปศาลแต่เช้านะครับ พักผ่อนไม่พอ มันจะไม่ดีกับสุขภาพผมเอา”



“อย่ามาเล่นลิ้นนะเว้ย บอกมาว่าจับอีกคนหนึ่งไว้ที่ไหน?” หมวดนเรศตะคอกดัง



“คุณตำรวจพูดเรื่องอะไรกันผมไม่เห็นจะเข้าใจเลย” มันทำสีหน้าไม่ทุกข์ร้อน แทนไทโยนรูปถ่ายสภาพศพของนายโจ้กับศพที่ตึกร้างเมื่อกี้ให้มันดู



“พวกเรารู้หมดแล้วว่านี่เป็นฝีมือของแก เพราะฉะนั้นบอกมาว่าเหยื่ออีกคนอยู่ที่ไหน?” ไอ้ศักดิ์มองรูปแล้วนิ่งไปพักหนึ่งก่อนที่จะหัวเราะลั่นขึ้น



“มึงหัวเราะอะไร?” หมวดนเรศเริ่มไม่พอใจมากขึ้น



“พวกมึงนั่นแหละทำอะไร! จะมาโยนคดีให้กูเพิ่มเหรอ ทำไม! ปิดคดีไม่ได้เลยจะเอากูเป็นแพะใช่ไหม เอาเลย! ยังไงกูก็โดนประหารชีวิตอยู่แล้วนี่ จะโดนประหารหนึ่งครั้งหรือสองครั้งก็เหมือนกัน เอามาเลย”



“จะมากไปแล้ว!” หมวดนเรศลุกขึ้นกระชากคอเสื้อมันดึงมาด้านหน้า แล้วผลักไปด้านหลัง ร่างบนเก้าอี้เซไปอย่างเร็วก่อนจะล้มกระแทกลงที่พื้น สองมือที่ถูกใส่กุญแจล็อกไว้กุมศีรษะอย่างเจ็บปวด หมวดนเรศเดินอ้อมโต๊ะไปกระชากมันให้ขึ้นมายืน



“มึงบอกมาว่าเอาอีกคนไปไว้ไหน?”



“กูไม่รู้เรื่องอะไรทั้งนั้น”



“ไม่ยอมบอกใช่ไหม” หมัดที่กำแน่นอัดเข้าที่ช่วงท้องของไอ้ศักดิ์อย่างแรง มันทรุดลงอย่างสุดทน



“มึงลุกขึ้นมา!”



“พอแล้ว” แทนไทกล่าวเสียงเรียบ



“คุณออกไปก่อน” เขาสั่งขึ้น หมวดนเรศปล่อยมือจากไอ้ศักดิ์ มันทิ้งตัวลงไปนอนที่พื้นเพราะยังไม่หายจุก



“บอกมาเถอะว่าเอาอีกคนไปไว้ที่ไหน? โทษนายจะได้ลดลง”



“กูบอกแล้วไงว่ากูไม่รู้ แล้วถึงพวกมึงจะยัดคดีอะไรให้กูเพิ่ม กูก็ไม่สนใจเหรอ อย่ามาเล่นบทตำรวจดีตำรวจเลวกับกูให้เสียเวลาเลย”



“นายมีความแค้นอะไรกับพวกเขา?”



“กูไม่รู้จักพวกมันด้วยซ้ำ”



“แต่อาวุธที่ใช้ฆ่าเขามีลายนิ้วมือของนายอยู่” แทนไทยื่นภาพของโจ้ให้มันดู ศักดิ์จ้องนิ่งจนเขาสังเกตเห็นความผิดปกติบางอย่างได้



“แล้วไง กูไม่รู้จักมัน ไม่เคยเห็นมัน”



“นายโกหก นายรู้จักกับเขา” แทนไททุบโต๊ะดัง มันสะดุ้งนิดหนึ่งก่อนที่จะตั้งสติตอบกลับ



“หากมึงสงสัยนักก็ถามกูไปเรื่อยๆ สิ แต่จำไว้นะ มึงมีเวลาแค่คืนนี้เท่านั้น เพราะพอพรุ่งนี้กูจะถูกส่งไปตัดสินคดีที่ศาลแล้ว” มันหัวเราะอีกครั้งในขณะที่ยันตัวขึ้นมานั่งบนเก้าอี้



แทนไทมองนิ่ง เพราะรู้ดีว่าไอ้ศักดิ์คงไม่ยอมบอกข้อมูลแน่ เพียงสักพักเขาลุกเดินออกจากห้องไปอย่างเงียบๆ ทิ้งมันไว้เพียงลำพัง เมื่อประตูปิดลง หมวดนเรศและใครหลายคนที่รออยู่ด้านนอกเข้ามาถามผล



“เป็นไงครับได้ผลไหมผู้กอง?” หมวดเจี้ยบถามขึ้น แทนไทส่ายหน้า



“ผมว่าให้ผมกระทืบมันจริงๆ ไปเลยดีกว่าครับผู้กอง” หมวดนเรศเสนอความเห็น



“ไม่มีประโยชน์ หากวิธีนั้นได้ผล มันคงบอกไปตั้งแต่เมื่อกี้แล้ว อีกอย่างนั่นไม่ใช่วิธีการของผม” แทนไทยืนยันวิถีของตน



“แต่ครั้งนี้มันไม่เหมือนที่ผ่านๆ มานะครับ หากเหยื่อคนที่เหลือตายไปจะสายเกินแก้นะครับ”



“ไม่ว่าจะสถานการณ์ไหน ผมก็ไม่ยอมให้มีการซ้อมผู้ต้องหาเด็ดขาด ที่เมื่อกี้ผมไม่ว่าอะไรเพราะอยากดูท่าทีของมันเท่านั้น” ทุกคนนิ่งเงียบลงในทันที



“ลองวิธีของผมไหมครับ” ไตรเอ่ยเสียงเบา แต่ดังชัดเจนในโสตปรระสาทการรับฟังของทุกคน



“วิธีไหน?” แทนไทถามขึ้น



ประตูห้องสอบสวนถูกเปิดออกอีกครั้ง ไตรเดินเซเข้ามาอย่างอ่อนแรงโดยที่ศีรษะไม่ได้มีผ้าพันแผลพันไว้ ไอ้ศักดิ์มองเขาแล้วจำได้ในทันทีว่าเป็นหนึ่งในคนที่ไปจับมันในคืนวาน



“นึกว่าใครที่แท้ก็ไอ้ไก่อ่อนนี่เอง” มันหัวเราะร่วน ไตรไม่พูดอะไร เขาเพียงโยนรูปภาพจำนวนหนึ่งให้ลงบนโต๊ะให้มันดู



ภาพคนที่คุ้นเคยอยู่เบื้องหน้าของไอ้ศักดิ์ ทั้งพ่อ แม่ น้องสาว และเมียของมัน ไตรเลื่อนรูปใบสุดท้ายที่อยู่ในมือเข้าไปใกล้มัน รูปเด็กผู้ชายวัยสองขวบ ทันทีที่เห็นรูปทั้งหมด มันกัดฟันแน่นเพราะรู้เจตนาของอีกฝ่าย ไอ้ศักดิ์ลุกขึ้นจะเอาเรื่อง แต่ไตรกลับตะบบเข้าที่ไหล่ของมันอย่างเท่าทัน คงเพราะกำลังบาดเจ็บ การกำราบนักโทษที่แม้จะมีกุญแจล็อกอยู่ที่มือจึงทำให้เขาต้องใช้แรงทั้งหมดที่มี มันจ้องหน้าไตรอย่างอาฆาตพร้อมถามกร้าวอย่างเอาเรื่อง



“มึงจะเอายังไง?”



“แค่เล่ามา ว่ารู้อะไรเกี่ยวกับสองศพในภาพนี้” ไตรเอ่ยถามเสียงเรียบและใจเย็นเพราะต้องการปกปิดอาการบาดเจ็บไม่ให้อีกฝ่ายรู้ เขานั่งลงที่เก้าอี้แล้วรอฟังคำตอบ



“กูไม่รู้อะไรทั้งนั้น” ไตรยื่นรูปของโจ้เข้าใกล้มัน เพราะแทนไทบอกไว้ว่ามันท่าทางจะรู้จักกับโจ้



“แกรู้จักคนในรูปนี้ อย่าปฏิเสธ ฉันแค่มาสืบคดีไม่ได้ต้องการหาแพะ ถ้าแกยืนยันว่าไม่ได้ทำ ก็บอกเรื่องที่รู้มา” ศักดิ์นิ่งไปแล้วเอ่ยขึ้นช้า ๆ



“มันตายเมื่อคืนใช่ไหม?”



“ใช่ คืนเดียวกับที่พวกฉันจับแกได้ แกรู้ใช่ไหมว่ามันตายใกล้กับห้องเช่าของแก”



“กูไม่ได้ทำ”



“คิดว่าฉันจะเชื่อเหรอ”



“กูไม่รู้จักมัน แล้วกูก็ไม่ได้ทำด้วย ตอนที่กูไปเจอ มันก็ตายไปแล้ว”



“แล้วลายนิ้วมือบนมีดที่ใช้เป็นอาวุธล่ะ”



“กูไม่รู้ กูไม่ได้จับอะไรทั้งนั้น มึงจะเชื่อหรือไม่ก็ตามใจ แต่มันตายก่อนที่กูจะไปที่นั่นแล้ว เพราะฉะนั้นอย่ายุ่งกับครอบครัวกู” มันตะคอกกลับเสียงดัง ไตรรู้สึกปวดหัวขึ้นมาอย่างกะทันหัน แต่ยังคงฝืนถามมันต่อ



“แล้วแกไปที่นั่นทำไม?” มันนิ่งอึ้งไป



“ฉันถามว่าแกไปที่นั่นทำไม?” ไตรเสียงดังกลับ เพราะเริ่มรู้สึกว่าตนฝืนไม่ไหวแล้วจึงต้องการเร่งให้จบ



“กูมีนัดแถวนั้น”



“กับใคร?” ไตรลุกขึ้นตะคอกดัง แต่เมื่อสิ้นคำเขากลับรู้สึกเหมือนภาพเบื้องหน้าวูบหายไป ก่อนที่จะล้มลงหมดสติที่พื้น หมวดเจี๊ยบที่ยืนดูสถานการณ์อยู่หน้าห้องต้องรีบเข้ามาช่วยในทันที...



"""

#ex_tk = word_tokenize(ex)
#ex_tk_trans = tfidf.transform([ex_tk])
#result = nb.predict(ex_tk_trans)
#prob = nb.predict_proba(ex_tk_trans)
#print('Class : ',nb.classes_)
#print('Prob : ',prob[0].round(2))
#print('Result : ',result[0])

def showProb(example):
    ex_tk = word_tokenize(example)
    ex_tk_trans = tfidf.transform([ex_tk])
    result = nb.predict(ex_tk_trans)
    prob = nb.predict_proba(ex_tk_trans).round(2)
    pdf = pd.DataFrame(data=prob,columns=nb.classes_)
    print('Result : ',result[0])
    return pdf

print(showProb(ex))

# Save Tfidf Vectorizer
tfidf_path = "fic-tfidf.pkl"
pickle.dump(tfidf, open(tfidf_path,"wb"))
# Save Model
model_path = "fic-model.pkl"
joblib.dump(nb, model_path)








